Page({

  /**
   * 页面的初始数据
   */
  data: {
    list: [{
        img: '../../images/cpts.png',
        title: '店铺门面设计店铺门面设计店铺门面设计',
      ms: '店面设计是店面给人的整体感觉，能够 体现店面的档次和个性。体现店面的档次和个性。',
        itme: '2019-03-27'
      },
      {
        img: '../../images/cpts.png',
        title: '店铺门面设计',
        ms: '店面设计是店面给人的整体感觉，能够 体现店面的档次和个性。体现店面的档次和个性。',
        itme: '2019-03-27'
      },
      {
        img: '../../images/cpts.png',
        title: '店铺门面设计',
        ms: '店面设计是店面给人的整体感觉，能够 体现店面的档次和个性。体现店面的档次和个性。',
        itme: '2019-03-27'
      },
      {
        img: '../../images/cpts.png',
        title: '店铺门面设计',
        ms: '店面设计是店面给人的整体感觉，能够 体现店面的档次和个性。体现店面的档次和个性。',
        itme: '2019-03-27'
      }, {
        img: '../../images/cpts.png',
        title: '店铺门面设计',
        ms: '店面设计是店面给人的整体感觉，能够 体现店面的档次和个性。体现店面的档次和个性。',
        itme: '2019-03-27'
      },
      {
        img: '../../images/cpts.png',
        title: '店铺门面设计',
        ms: '店面设计是店面给人的整体感觉，能够 体现店面的档次和个性。体现店面的档次和个性。',
        itme: '2019-03-27'
      },
      {
        img: '../../images/cpts.png',
        title: '店铺门面设计',
        ms: '店面设计是店面给人的整体感觉，能够 体现店面的档次和个性。体现店面的档次和个性。',
        itme: '2019-03-27'
      },
      {
        img: '../../images/cpts.png',
        title: '店铺门面设计',
        ms: '店面设计是店面给人的整体感觉，能够 体现店面的档次和个性。体现店面的档次和个性。',
        itme: '2019-03-27'
      }
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function() {

  }
})